# GetBoundingBox Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Solid..::..GetBoundingBox Method
Solid Class See Also
---
Retrieves a box that circumscribes the solid geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public BoundingBoxXYZ GetBoundingBox()
```

Visual Basic
---
```text
Public Function GetBoundingBox As BoundingBoxXYZ
```

Visual C++
---
```text
public:
BoundingBoxXYZ^ GetBoundingBox()
```

# Remarks
The bounding box information is stored as bounds in local coordinates and a transform. So the transform is to be taken in to account when using the bounds. This is different from the bounding box returned by Element.BoundingBox in that the bounding box returned by that routine stores the bounds in modeling coordinates with an identity transform.
# See Also
Solid Class
Autodesk.Revit.DB Namespace